Revit 2026 API

# EndTreatmentTypeCreate(Document, String) Method

---

Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static EndTreatmentType Create(
	Document doc,
	string treatment
)
```
```vb
Public Shared Function Create (
	doc As Document,
	treatment As String
) As EndTreatmentType
```
```cpp
public:
static EndTreatmentType^ Create(
	Document^ doc,
	String^ treatment
)
```
```fsharp
static member Create :
        doc : Document *
        treatment : string -> EndTreatmentType
```

#### Parameters

doc Document
     Returns the newly created EndTreatmentType in the specified document.
treatment String
     This string will be se to the endTreatment parameter.

#### Return Value

EndTreatmentType Returns the newly created EndTreatmentType in the specified document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EndTreatmentType Class

Create Overload

Autodesk.Revit.DB.Structure Namespace